Public Attributes | List of all members
API_SavePars_PlanDump Struct Reference
Project Operations
Contains the different options for saving a plan dump from Archicad. More...
#include <APIdefs_Automate.h>
 Public Attributes
bool  | elementsOn
Include all elements in the plan dump file.
bool  | attributesOn
Include all attributes in the plan dump file.
bool  | propertiesOn
Include properties in the plan dump file.
Detailed Description
Contains the different options for saving a plan dump from Archicad.
Remarks
These options correspond to the different settings in the File/Save dialogs.
Member Data Documentation
◆ attributesOn
 API_SavePars_PlanDump::attributesOn
Include all attributes in the plan dump file.
◆ elementsOn
 API_SavePars_PlanDump::elementsOn
Include all elements in the plan dump file.
◆ propertiesOn
 API_SavePars_PlanDump::propertiesOn
Include properties in the plan dump file.